# Проект FitLife - MVP версия 1.0
WATER_PER_KG = 30  # константа для расчета нормы воды
WATER_IN_LIT = 1000  # константа для перевода мл в литр

# 1. Знакомство - Запрашиваем имя (user_name) и возраст (user_age)
# Спрашиваем у пользователя имя и сохраняем в переменную user_name
user_name = input("Привет! Как тебя зовут? ")
# Спрашиваем возраст и сохраняем в переменную user_age
user_age = int(input("Подскажи твой возраст(в лет): "))

# 2. Сбор данных
# Запрашиваем вес (в кг) и сохраняем в user_weight (тип float)
user_weight = float(input("Скажи свой вес(в кг): "))

# Запрашиваем рост (в метрах) и сохраняем в user_height (тип float)
user_height = float(input("Какой твой рост(в метр)? "))

# 3. Логика расчетов
# Формула ИМТ: вес разделить на (рост в квадрате)
# Рассчитываем индекс массы тела и округляем с помощью round
bmi = round((user_weight / (user_height ** 2)), 1)

# Подсчет воды: вес * 30 мл
# Рассчитываем норму воды и переводим в литры
water_needed = (user_weight * WATER_PER_KG) / WATER_IN_LIT

# 4. Вывод красивого результата
print(f'Отчет для пользователя: {user_name} ({user_age} г.)')
print(f'Твой Индекс Массы Тела: {bmi}')
print(f'Рекомендуемая норма воды: {water_needed} л. в день\n')
print("Расчет окончен. Будьте здоровы!")
